#+STARTUP: overview
#+HTML_HEAD: <style type="text/css">body{ max-width:50%; }</style>
#+OPTIONS: \n:t
#+OPTIONS: toc:nil
*** Buffers
| Buffer   | Volume/sample (mL) | # samples | total volume (mL) |
|----------+--------------------+-----------+-------------------|
| Glycine  |                  1 |       4.5 |               4.5 |
| 1x PBS   |                 25 |           |             112.5 |
| lysis    |                0.5 |           |              2.25 |
| Dilution |                3.8 |           |              17.1 |
#+TBLFM: @2$4=$2*@2$3::@3$4=$2*@2$3::@4$4=$2*@2$3::@5$4=$2*@2$3
*** hypotonic buffer (5mL per sample)
| Component        | TargConc (mM) | Stock Conc (M) | Stock Vol (uL) |
|------------------+---------------+----------------+----------------|
| Tris-HCl (pH7.5) |            10 |              1 |            110 |
| NaCl             |            10 |              1 |            110 |
| MgCl2            |           2.5 |              1 |           27.5 |
|------------------+---------------+----------------+----------------|
| TargVol(mL)      |            11 |            H2O |        10.7525 |
#+TBLFM: @2$4=(@5$2*@2$2)/(@2$3)::@3$4=(@5$2*@3$2)/(@3$3)::@4$4=(@5$2*@4$2)/(@4$3)::@5$4=@5$2-vsum(@2..@4)/1000
*** RIP buffer (1mL per sample)
| Component        | TargConc (mM) | Stock Conc (M) | Stock Vol (uL) |
|------------------+---------------+----------------+----------------|
| Tris-HCl (pH7.5) |            50 |              1 |           125. |
| NaCl             |           150 |              1 |           375. |
| MgCl2            |             1 |              1 |            2.5 |
| IGEPAL CA-630    |          0.5% |            10% |           125. |
| EDTA             |             5 |            0.5 |            25. |
| DTT              |             1 |              1 |            2.5 |
| RNaseOUT (u/mL)  |           200 |          40000 |           12.5 |
|------------------+---------------+----------------+----------------|
| TargVol(mL)      |           2.5 |            H2O |         1.8325 |
#+TBLFM: @2$4=(@9$2*@2$2)/(@2$3)::@3$4=(@9$2*@3$2)/(@3$3)::@4$4=(@9$2*@4$2)/(@4$3)::@5$4=(@9$2*1000*@5$2)/(@5$3)::@6$4=(@9$2*@6$2)/(@6$3)::@7$4=(@9$2*@7$2)/(@7$3)::@8$4=(@9$2*1000*@8$2)/(@8$3)::@9$4=@9$2-vsum(@2..@8)/1000
*** NT2 buffer Day1 0.5mL/sample
| Component        | TargConc (mM) | Stock Conc (M) | Stock Vol (uL) |
|------------------+---------------+----------------+----------------|
| Tris-HCl (pH7.5) |            50 |              1 |            75. |
| NaCl             |           150 |              1 |           225. |
| MgCl2            |             1 |              1 |            1.5 |
| IGEPAL CA-630    |         0.05% |            10% |            7.5 |
| EDTA             |             5 |            0.5 |            15. |
| DTT              |             1 |              1 |            1.5 |
| RNaseOUT (u/mL)  |           200 |          40000 |            7.5 |
|------------------+---------------+----------------+----------------|
| TargVol(mL)      |           1.5 |       H2O (mL) |          1.167 |
#+TBLFM: @2$4=(@9$2*@2$2)/(@2$3)::@3$4=(@9$2*@3$2)/(@3$3)::@4$4=(@9$2*@4$2)/(@4$3)::@5$4=(@9$2*1000*@5$2)/(@5$3)::@6$4=(@9$2*@6$2)/(@6$3)::@7$4=(@9$2*@7$2)/(@7$3)::@8$4=(@9$2*1000*@8$2)/(@8$3)::@9$4=@9$2-vsum(@2..@8)/1000
*** NT2 buffer Day2 5.5 mL/sample (x2 for target and IgG)
| Component        | TargConc (mM) | Stock Conc (M) | Stock Vol (uL) |
|------------------+---------------+----------------+----------------|
| Tris-HCl (pH7.5) |            50 |              1 |            600 |
| NaCl             |           150 |              1 |           1800 |
| MgCl2            |             1 |              1 |             12 |
| IGEPAL CA-630    |         0.05% |            10% |            60. |
| EDTA             |             5 |            0.5 |           120. |
| DTT              |             1 |              1 |             12 |
| RNaseOUT (u/mL)  |            50 |          40000 |             15 |
|------------------+---------------+----------------+----------------|
| TargVol(mL)      |            12 |       H2O (mL) |          9.381 |
#+TBLFM: @2$4=(@9$2*@2$2)/(@2$3)::@3$4=(@9$2*@3$2)/(@3$3)::@4$4=(@9$2*@4$2)/(@4$3)::@5$4=(@9$2*1000*@5$2)/(@5$3)::@6$4=(@9$2*@6$2)/(@6$3)::@7$4=(@9$2*@7$2)/(@7$3)::@8$4=(@9$2*1000*@8$2)/(@8$3)::@9$4=@9$2-vsum(@2..@8)/1000
*** Lysis buffer (for 60mm dish, try 100 uL per plate)
| Component        | TargConc (mM) | Stock Conc (M) | Stock Vol (uL) |
|------------------+---------------+----------------+----------------|
| Tris-HCl (pH7.5) |            50 |              1 |            100 |
| NaCl             |           150 |              1 |            300 |
| MgCl2            |             1 |              1 |              2 |
| IGEPAL CA-630    |          0.5% |            10% |           100. |
| EDTA             |             5 |            0.5 |            20. |
| PIC              |             1 |            100 |             20 |
|------------------+---------------+----------------+----------------|
| TargVol(mL)      |             2 |            H2O |          1.458 |
#+TBLFM: @2$4=(@8$2*@2$2)/(@2$3)::@3$4=(@8$2*@3$2)/(@3$3)::@4$4=(@8$2*@4$2)/(@4$3)::@5$4=(@8$2*1000*@5$2)/(@5$3)::@6$4=(@8$2*@6$2)/(@6$3)::@7$4=(@8$2*1000*@7$2)/(@7$3)::@8$4=@8$2-vsum(@2..@7)/1000
** Buffer preparations
   Note 1: all buffers should be sterile filtered and good for 2 weeks at
   4 degree protected from light
   1. EDTA buffer (30 mL per mouse)
| Component   | TargConc (mM) | Stock Conc (M) | Stock Vol (mL) |
|-------------+---------------+----------------+----------------|
| NaCl        |           113 |           4.52 |           3.75 |
| KCl         |             5 |              2 |          0.375 |
| NaH2PO4     |           0.5 |            0.5 |           0.15 |
| HEPES       |            10 |              1 |            1.5 |
| EDTA        |             5 |            0.5 |            1.5 |
|-------------+---------------+----------------+----------------|
| Component   | TargConc (mM) |             MW |    Weight (mg) |
|-------------+---------------+----------------+----------------|
| Glucose     |            10 |         180.16 |         270.24 |
| BDM         |            10 |         101.11 |        151.665 |
| Taurine     |            10 |         125.15 |        187.725 |
|-------------+---------------+----------------+----------------|
| TargVol(mL) |           150 |            H2O |          139.3 |
| Ph to 7.8   |        approx |        1N NaOH |           0.75 |
#+TBLFM: $4=@11$2 - vsum(@2..@6) - @12$4::@2$4=(@11$2*@2$2)/(@2$3*1000)::@3$4=(@11$2*@3$2)/(@3$3*1000)::@4$4=(@11$2*@4$2)/(@4$3*1000)::@5$4=(@11$2*@5$2)/(@5$3*1000)::@6$4=(@11$2*@6$2)/(@6$3*1000)::@8$4=(@11$2 / 1000) * @8$2 * @8$3::@9$4=(@11$2 / 1000) * @9$2 * @9$3::@10$4=(@11$2 / 1000) * @10$2 * @10$3::@12$4=@11$2/200

   2. Perfusion buffer (90 mL per mouse, accounting for Col and STOP)
| Component   | TargConc (mM) | Stock Conc (M) | Stock Vol (mL) |
|-------------+---------------+----------------+----------------|
| NaCl        |           113 |           4.52 |           3.75 |
| KCl         |             5 |              2 |          0.375 |
| NaH2PO4     |           0.5 |            0.5 |           0.15 |
| HEPES       |            10 |              1 |            1.5 |
| MgCl2       |             1 |              1 |           0.15 |
|-------------+---------------+----------------+----------------|
| Component   | TargConc (mM) |             MW |    Weight (mg) |
|-------------+---------------+----------------+----------------|
| Glucose     |            10 |         180.16 |         270.24 |
| BDM         |            10 |         101.11 |        151.665 |
| Taurine     |            10 |         125.15 |        187.725 |
|-------------+---------------+----------------+----------------|
| TargVol(mL) |           150 |            H2O |          132.2 |
| Ph to 7.8   |        approx |        1N NaOH |           0.75 |
#+TBLFM: $4=@11$2 - vsum(@2..@6) - @12$4::@2$4=(@11$2*@2$2)/(@2$3*1000)::@3$4=(@11$2*@3$2)/(@3$3*1000)::@4$4=(@11$2*@4$2)/(@4$3*1000)::@5$4=(@11$2*@5$2)/(@5$3*1000)::@6$4=(@11$2*@6$2)/(@6$3*1000)::@8$4=(@11$2 / 1000) * @8$2 * @8$3::@9$4=(@11$2 / 1000) * @9$2 * @9$3::@10$4=(@11$2 / 1000) * @10$2 * @10$3::@12$4=@11$2/200
   3. Collagenase buffer (60 mL per mouse) in perfusion buffer
      Prepare right before procedure, warm to 37 degree
| Component     | TargConc (mg/mL) | Weight (mg)    |
|---------------+------------------+----------------|
| Collagenase 2 |              0.5 |           125. |
| Collagenase 4 |              0.5 |           125. |
| Protease XIV  |             0.05 |           12.5 |
| Volume (mL)   |              250 |                |
#+TBLFM: @2$3=$2 * @5$2::@3$3=$2 * @5$2::@4$3=$2 * @5$2
   4. Stop buffer (10 mL per mouse)
| Component             | TargConc (%) | volumn |
|-----------------------+--------------+--------|
| FBS                   |            5 |      2 |
| perfusion Buffer (mL) |           40 |     38 |
#+TBLFM: @2$3=@2$2*@3$2/100::@3$3=@3$2 - @2$3
** Buffer preparations
   Note 1: all buffers should be sterile filtered and good for 2 weeks at
   4 degree protected from light
   1. EDTA buffer (20 mL per mouse)
| Component   | TargConc (mM) | Stock Conc (M) | Stock Vol (mL) |
|-------------+---------------+----------------+----------------|
| NaCl        |           113 |           4.52 |             4. |
| KCl         |             5 |              2 |            0.4 |
| NaH2PO4     |           0.5 |            0.5 |           0.16 |
| HEPES       |            10 |              1 |            1.6 |
| EDTA        |             5 |            0.5 |            1.6 |
|-------------+---------------+----------------+----------------|
| Component   | TargConc (mM) |             MW |    Weight (mg) |
|-------------+---------------+----------------+----------------|
| Glucose     |            10 |         180.16 |        288.256 |
| BDM         |            10 |         101.11 |        161.776 |
| Taurine     |            10 |         125.15 |         200.24 |
|-------------+---------------+----------------+----------------|
| TargVol(mL) |           160 |            H2O |         151.44 |
| Ph to 7.8   |        approx |        1N NaOH |            0.8 |
#+TBLFM: $4=@11$2 - vsum(@2..@6) - @12$4::@2$4=(@11$2*@2$2)/(@2$3*1000)::@3$4=(@11$2*@3$2)/(@3$3*1000)::@4$4=(@11$2*@4$2)/(@4$3*1000)::@5$4=(@11$2*@5$2)/(@5$3*1000)::@6$4=(@11$2*@6$2)/(@6$3*1000)::@8$4=(@11$2 / 1000) * @8$2 * @8$3::@9$4=(@11$2 / 1000) * @9$2 * @9$3::@10$4=(@11$2 / 1000) * @10$2 * @10$3::@12$4=@11$2/200

   2. Perfusion buffer (20 mL per mouse, accounting for Col and STOP)
| Component   | TargConc (mM) | Stock Conc (M) | Stock Vol (mL) |
|-------------+---------------+----------------+----------------|
| NaCl        |           113 |           4.52 |             4. |
| KCl         |             5 |              2 |            0.4 |
| NaH2PO4     |           0.5 |            0.5 |           0.16 |
| HEPES       |            10 |              1 |            1.6 |
| MgCl2       |             1 |              1 |           0.16 |
|-------------+---------------+----------------+----------------|
| Component   | TargConc (mM) |             MW |    Weight (mg) |
|-------------+---------------+----------------+----------------|
| Glucose     |            10 |         180.16 |        288.256 |
| BDM         |            10 |         101.11 |        161.776 |
| Taurine     |            10 |         125.15 |         200.24 |
|-------------+---------------+----------------+----------------|
| TargVol(mL) |           160 |            H2O |         152.88 |
| Ph to 7.8   |        approx |        1N NaOH |            0.8 |
#+TBLFM: $4=@11$2 - vsum(@2..@6) - @12$4::@2$4=(@11$2*@2$2)/(@2$3*1000)::@3$4=(@11$2*@3$2)/(@3$3*1000)::@4$4=(@11$2*@4$2)/(@4$3*1000)::@5$4=(@11$2*@5$2)/(@5$3*1000)::@6$4=(@11$2*@6$2)/(@6$3*1000)::@8$4=(@11$2 / 1000) * @8$2 * @8$3::@9$4=(@11$2 / 1000) * @9$2 * @9$3::@10$4=(@11$2 / 1000) * @10$2 * @10$3::@12$4=@11$2/200
   3. Collagenase buffer (10 mL per mouse) in perfusion buffer. Prepare right before procedure, warm to 37 degree
| Component                | TargConc (mg/mL) | Weight (mg) |
|--------------------------+------------------+-------------|
| Collagenase 2            |              3.2 |        160. |
| Soybean Trysin Inhibitor |              0.2 |         10. |
| Elastase suspension (uL) |             0.75 |   1415.0943 |
| Volume (mL)              |               50 |             |
#+TBLFM: @2$3=$2 * @5$2::@3$3=$2 * @5$2::@4$3=(($2 * @5$2) / 26.5) * 1000
   4. Stop buffer (5 mL per mouse)
| Component             | TargConc (%) | volumn |
|-----------------------+--------------+--------|
| FBS                   |            5 |      1 |
| perfusion Buffer (mL) |           20 |     19 |
#+TBLFM: @2$3=@2$2*@3$2/100::@3$3=@3$2 - @2$3
** 293
   24 well plate
|    well |  6.5 |           |
|---------+------+-----------|
| Plasmid | DMEM | turbofect |
|---------+------+-----------|
|    1.07 |  100 |         2 |
|   6.955 | 650. |       13. |
#+TBLFM: @4$1=@1$2*@3$1::@4$2=@1$2*@3$2::@4$3=@1$2*@3$3
protein related analysis done 48 hours post, RNA related can be done 24 post
** Cos-7
10 cm dish
| plate         |                     1 |                |           |           |
|---------------+-----------------------+----------------+-----------+-----------|
| construct     | concentration (ng/uL) | Plasmid volume | DMEM (uL) | Turbofect |
|---------------+-----------------------+----------------+-----------+-----------|
| pCDNA3.1-ShhN |               1547.95 |      3.8760942 |       600 |        12 |
| linearized    |                 939.6 |      6.3856960 |       600 |        12 |
#+TBLFM: @3$3=6*1000/@3$2::@4$3=6*1000/@4$2
for linearizing, 6.5 uL of plasmid (10ug) + 5 uL of NEBuffer3.1 + 10 uL of BglII (NEB R0144S) + 28.5 H2O. Digest at 37c for 2 hours
Column purify after.
